# Brewfile: https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# app store
mas "Agenda", id:1287445660
mas "Amphetamine", id: 937984704
mas "Evernote", id: 406056744
mas "Quiver", id: 866773894
mas "Shush", id: 496437906
mas "Spillo", id: 873245660
mas "Textual 7", id: 1262957439
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696

# languages

# tools
brew "ag"
brew "asdf"
brew "aspell"
brew "fzf"
brew "htop-osx"
brew "ipcalc"
brew "jq"
brew "mas"
brew "mtr"
brew "reattach-to-user-namespace"
brew "tmux"
brew "wget"
brew "zsh-syntax-highlighting"

# devops tools
brew "awscli"
brew "azure-cli"
brew "packer"
brew "terraform"

# casks

# infosec tools
brew "chkrootkit"
brew "nmap"
